conf/src/InformationRegisters/ЭП_ПодстатусыТехническихПроектов/ЭП_ПодстатусыТехническихПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ПодстатусыТехническихПроектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Подстатус</name>
    <type>
      <types>EnumRef.ЭП_Подстатусы</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ТехПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/ЭП_Подстатусы/ЭП_Подстатусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_Подстатусы</name>
  <enumValues>
    <name>НаписаниеПостановки</name>
  </enumValues>
  <enumValues>
    <name>ДоработкаПостановки</name>
  </enumValues>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>ДоработкаПоЗамечаниям</name>
  </enumValues>
  <enumValues>
    <name>ВТестировании</name>
  </enumValues>
  <enumValues>
    <name>ПринятоПостановщиком</name>
  </enumValues>
  <enumValues>
    <name>ПринятоФЗ</name>
  </enumValues>
</mdclass:Enum>

conf/src/Enums/СтатусыТехническихПроектов/СтатусыТехническихПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТехническихПроектов</name>
  <enumValues>
    <name>НеЗапланирован</name>
  </enumValues>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Активен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

conf/src/InformationRegisters/ЭП_ПодстатусыТехническихПроектов/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Замещение = Ложь Тогда 
		
		Для каждого ТекЗапись Из ЭтотОбъект Цикл
			
			ТекПроект 		= ТекЗапись.ТехПроект;
			ТекПериод 		= ТекЗапись.Период;
			ТекПодстатус 	= ТекЗапись.Подстатус;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ПодстатусыТехническихПроектовСрезПоследних.Подстатус КАК Подстатус
			|ИЗ
			|	РегистрСведений.ЭП_ПодстатусыТехническихПроектов.СрезПоследних(&Дата, ТехПроект = &ТехПроект) КАК ЭП_ПодстатусыТехническихПроектовСрезПоследних";
			
			Запрос.УстановитьПараметр("Дата", ТекПериод);
			Запрос.УстановитьПараметр("ТехПроект", ТекПроект);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда 
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Выборка.Следующий();
				
				ПоследнийПодстатус = Выборка.Подстатус;
				
				Если ПоследнийПодстатус = ТекПодстатус Тогда 				
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = 	СтрШаблон("Предыдущий подстатус имеет такое же значение: ""%1"", необходимо добавить новое значение",
					Выборка.Подстатус);
					Сообщение.Сообщить(); 
					
					Отказ = Истина;
					
				КонецЕсли;	
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Статус = ТекЗапись.Подстатус;
		
		Если Статус = Перечисления.ЭП_Подстатусы.НаписаниеПостановки 
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ДоработкаПостановки 
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ВРазработке 
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ДоработкаПоЗамечаниям
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ВТестировании
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ПринятоПостановщиком
			ИЛИ Статус = Перечисления.ЭП_Подстатусы.ПринятоФЗ Тогда 
			
			ОбъектТП = ТекЗапись.ТехПроект.ПолучитьОбъект();
			
			Если НЕ ОбъектТП.Статус = Перечисления.СтатусыТехническихПроектов.Активен И НЕ Отказ Тогда
				
				ОбъектТП.Статус = Перечисления.СтатусыТехническихПроектов.Активен;
				ОбъектТП.Записать();
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
